In [4]:
import cx_Oracle

In [2]:
conn = cx_Oracle.connect('user1234/1234@127.0.0.1:1521/XE')
cursor = conn.cursor()

In [5]:
# 테이블 생성
cursor.execute('''
CREATE TABLE crawling(
  no    NUMBER(7)   NOT NULL PRIMARY KEY,
  name  VARCHAR(32) NOT NULL, 
  phone VARCHAR(32) NOT NULL, 
  email VARCHAR(64) NOT NULL,
  rdate DATE        NOT NULL
)
''')

In [4]:
# 테이블 삭제
cursor.execute('DROP TABLE crawling')

In [6]:
# Sequence 생성 
cursor.execute('''
CREATE SEQUENCE crawling_seq
  START WITH 1           
  INCREMENT BY 1         
  MAXVALUE 9999999 
  CACHE 2             
  NOCYCLE            
''')

In [ ]:
# Sequence delete
cursor.execute('DROP SEQUENCE crawling_seq')

In [7]:
#레코드 생성
sql = '''
INSERT INTO crawling (no, name, phone, email, rdate) 
VALUES (crawling_seq.nextval, :name, :phone, :email, sysdate)
''' 
 
result = cursor.execute(sql, ('홍길순', '021-322-1542', 'mail1@mail.com'))
print('result:', result) # None: 정상 처리, Exception: 에러
 
cursor.execute(sql, ('나길순', '021-322-1542', 'mail2@mail.com'))
cursor.execute(sql, ('다길순', '021-322-1542', 'mail3@mail.com'))
 
conn.commit()

result: None

### 목록

In [11]:
# 목록
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  ORDER BY no ASC
'''
cursor.execute(sql)

In [12]:
rows = cursor.fetchall() # 모든 레코드의 산출

In [13]:
rows

[(1,
  '홍길순',
  '021-322-1542',
  'mail1@mail.com',
  datetime.datetime(2021, 4, 13, 9, 28, 35)),
 (2,
  '나길순',
  '021-322-1542',
  'mail2@mail.com',
  datetime.datetime(2021, 4, 13, 9, 28, 35)),
 (3,
  '다길순',
  '021-322-1542',
  'mail3@mail.com',
  datetime.datetime(2021, 4, 13, 9, 28, 35))]

In [14]:
for row in rows:
    fmt = "{}, {}, {}, {}, {} "
    print (fmt.format(row[0], row[1], row[2], row[3], row[4]))

1, 홍길순, 021-322-1542, mail1@mail.com, 2021-04-13 09:28:35
2, 나길순, 021-322-1542, mail2@mail.com, 2021-04-13 09:28:35
3, 다길순, 021-322-1542, mail3@mail.com, 2021-04-13 09:28:35

### 조회

In [15]:
# 한건의 레코드 조회
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  WHERE no=:no
  '''

In [16]:
cursor.execute(sql, (1,)) # (1,): Tuple로 인식

In [17]:
row = cursor.fetchone() # 하나의 레코드 산출

In [18]:
fmt = "{}, {}, {}, {}, {} "
print (fmt.format(row[0], row[1], row[2], row[3], row[4]))

1, 홍길순, 021-322-1542, mail1@mail.com, 2021-04-13 09:28:35

### 조건이 추가된 조회

In [19]:
# 한건의 레코드 조회, 조건의 추가
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  WHERE no=:no and name=:name
'''

In [20]:
cursor.execute(sql, (1, '홍길순'))

In [21]:
row = cursor.fetchone() # 하나의 레코드 산출

In [22]:
if row != None:
    fmt = "{}, {}, {}, {}, {} "
    print (fmt.format(row[0], row[1], row[2], row[3], row[4]))
else:
    print('일치하는 레코드가 없습니다.')

1, 홍길순, 021-322-1542, mail1@mail.com, 2021-04-13 09:28:35

### 수정

In [23]:
# 수정
sql='''
  UPDATE crawling 
  SET name=:name, phone=:phone, email=:email, rdate=sysdate
  WHERE no=:no
'''

In [24]:
cursor.execute(sql, ('아로미', '010-123-1234', 'mail10@mail.com', 1))

In [25]:
conn.commit()

In [26]:
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  WHERE no=:no
'''

In [27]:
cursor.execute(sql, (1,))

In [28]:
row = cursor.fetchone() # 하나의 레코드 산출

In [29]:
fmt = "{}, {}, {}, {}, {} "
print (fmt.format(row[0], row[1], row[2], row[3], row[4]))

1, 아로미, 010-123-1234, mail10@mail.com, 2021-04-13 09:40:43

### 삭제

In [30]:
# 삭제
sql='''
  DELETE FROM crawling
  WHERE no=:no
'''

In [31]:
cursor.execute(sql, (1,))

In [32]:
conn.commit()

In [33]:
cursor.close()
conn.close()

### pandas와 oracle 데이터 주고받기

In [34]:
!pip show pandas

Name: pandas
Version: 1.2.3
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\programdata\anaconda3\envs\pydata\lib\site-packages
Requires: pytz, python-dateutil, numpy
Required-by: seaborn

In [35]:
!pip show cx_oracle

Name: cx-Oracle
Version: 8.1.0
Summary: Python interface to Oracle
Home-page: https://oracle.github.io/python-cx_Oracle
Author: "Anthony Tuininga",
Author-email: "anthony.tuininga@gmail.com",
License: BSD License
Location: c:\programdata\anaconda3\envs\pydata\lib\site-packages
Requires:
Required-by:

In [1]:
!pip show sqlalchemy

Name: SQLAlchemy
Version: 1.4.7
Summary: Database Abstraction Library
Home-page: http://www.sqlalchemy.org
Author: Mike Bayer
Author-email: mike_mp@zzzcomputing.com
License: MIT
Location: c:\programdata\anaconda3\envs\pydata\lib\site-packages
Requires: greenlet, importlib-metadata
Required-by:

In [2]:
# Oracle -> Pandas
import pandas as pd
from sqlalchemy import create_engine  # Pandas -> Oracle

In [5]:
conn = cx_Oracle.connect('user1234/1234@127.0.0.1:1521/XE')

In [6]:
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  ORDER BY no ASC
'''

In [7]:
df = pd.read_sql(sql, conn)

In [8]:
df

   NO NAME         PHONE           EMAIL               RDATE
0   2  나길순  021-322-1542  mail2@mail.com 2021-04-13 09:28:35
1   3  다길순  021-322-1542  mail3@mail.com 2021-04-13 09:28:35

In [9]:
# DataFrame은 컬럼명을 대문자로 저장함으로 대소문자 주의
max_val = max(df['NO'])+1  
max_val

4

In [10]:
# DataFrame에 1명의 주소를 추가할것, 컬럼명 대소문자 구분.
new_row = {'NO':max_val, 'NAME':'아로미', 'PHONE': '000-1111-1111', 'EMAIL': 'mail7', 'RDATE':'2020-06-25 17:00:00'}
df2 = df.append(new_row, ignore_index=True)

In [11]:
df2

   NO NAME          PHONE           EMAIL                RDATE
0   2  나길순   021-322-1542  mail2@mail.com  2021-04-13 09:28:35
1   3  다길순   021-322-1542  mail3@mail.com  2021-04-13 09:28:35
2   4  아로미  000-1111-1111           mail7  2020-06-25 17:00:00

In [12]:
# Oracle 테이블 다시 생성
conn = cx_Oracle.connect('user1234/1234@127.0.0.1:1521/XE')
cursor = conn.cursor()

In [14]:
cursor.execute('DROP TABLE crawling')

In [15]:
cursor.execute('''
CREATE TABLE crawling (
  no    NUMBER(7)   NOT NULL PRIMARY KEY,
  name  VARCHAR(32) NOT NULL, 
  phone VARCHAR(32) NOT NULL, 
  email VARCHAR(64) NOT NULL,
  rdate DATE        NOT NULL
)
''')

In [16]:
cursor.close()
conn.close()

In [17]:
# Oracle Date 지원 형식으로 변경, 컬럼명 대소문자 구분
df2['RDATE'] = pd.to_datetime(df2['RDATE']) 
df2

   NO NAME          PHONE           EMAIL               RDATE
0   2  나길순   021-322-1542  mail2@mail.com 2021-04-13 09:28:35
1   3  다길순   021-322-1542  mail3@mail.com 2021-04-13 09:28:35
2   4  아로미  000-1111-1111           mail7 2020-06-25 17:00:00

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NO      3 non-null      int64
 1   NAME    3 non-null      object
 2   PHONE   3 non-null      object
 3   EMAIL   3 non-null      object
 4   RDATE   3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 248.0+ bytes

### df2를 crawling테이블로 저장

In [19]:
engine = create_engine('oracle+cx_oracle://user1234:1234@localhost:1521/?service_name=XE', echo=False)

In [22]:
df2.to_sql(name='crawling', con = engine, if_exists = 'append', index=False)

In [23]:
# 등록 확인
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  ORDER BY no ASC
'''

In [26]:
# Oracle 테이블 다시 생성
conn = cx_Oracle.connect('user1234/1234@127.0.0.1:1521/XE')
cursor = conn.cursor()

In [27]:
cursor.execute(sql)

In [28]:
rows = cursor.fetchall() # 모든 레코드의 산출

In [29]:
for row in rows:
    fmt = "{}, {}, {}, {}, {} "
    print (fmt.format(row[0], row[1], row[2], row[3], row[4]))

2, 나길순, 021-322-1542, mail2@mail.com, 2021-04-13 09:28:35
3, 다길순, 021-322-1542, mail3@mail.com, 2021-04-13 09:28:35
4, 아로미, 000-1111-1111, mail7, 2020-06-25 17:00:00

In [30]:
# Oracle -> Pandas
conn = cx_Oracle.connect('user1234/1234@127.0.0.1:1521/XE')

In [31]:
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  ORDER BY no ASC
'''

In [32]:
df = pd.read_sql(sql, conn)

In [33]:
df

   NO NAME          PHONE           EMAIL               RDATE
0   2  나길순   021-322-1542  mail2@mail.com 2021-04-13 09:28:35
1   3  다길순   021-322-1542  mail3@mail.com 2021-04-13 09:28:35
2   4  아로미  000-1111-1111           mail7 2020-06-25 17:00:00